src/erlang/concurrency/otp.org
** 实现事务
下面的代码在查询产生异常错误时会让客户端崩溃：

#+BEGIN_SRC erlang 
  -module(server2).
  -export([start/2, rpc/2]).

  start(Name, Mod) ->
      register(Name, spawn(fun() -> loop(Name,Mod,Mod:init()) end)).

  rpc(Name, Request) ->
      Name ! {self(), Request},
      receive
	  {Name, crash} -> exit(rpc);
	  {Name, ok, Response} -> Response
      end.

  loop(Name, Mod, OldState) ->
      receive
	  {From, Request} ->
	      try Mod:handle(Request, OldState) of
		  {Response, NewState} ->
		      From ! {Name, ok, Response},
		      loop(Name, Mod, NewState)
	      catch
		  _:Why ->
		      log_the_error(Name, Request, Why),
		      %% send a message to cause the client to crash
		      From ! {Name, crash},
		      %% loop with the *original* state
		      loop(Name, Mod, OldState)
	      end
      end.

  log_the_error(Name, Request, Why) ->
      io:format("Server ~p request ~p ~n"
		"caused exception ~p~n", 
		[Name, Request, Why]).
#+END_SRC

这段代码在服务器里实现了 _事务语义_ ：
+ 在处理函数抛出异常错误时用 State (状态)的初始值继续循环
  + 当处理函数失败时,服务器会给发送问题消息的客户端发送一个消息,让它崩溃
    + 这个客户端不能继续工作,因为它发送给服务器的请求导致了处理函数的崩溃
    + 其他想要使用服务器的客户端不会受到影响
+ 如果处理函数成功了,它就会用处理函数提供的 NewState 值继续循环 

请注意,这个服务器使用的回调模块和用于 server1 的回调模块一模一样。通过 _修改服务器_ 并 *保持* _回调模块不变_ ,就能 *修改回调模块的非业务行为* 

#+BEGIN_EXAMPLE
  从 server1 转到 server2 时,必须对回调模块做一点小小的改动

  也就是把 -import 声明里的 server1 改成 server2 。除此之外并无其他改动
#+END_EXAMPLE


为了测试把name_server修改如下：

#+BEGIN_SRC erlang 
  -module(name_server).
  -export([init/0, add/2, find/1, handle/2]).
  -import(server2, [rpc/2]).

  %% client routines
  add(Key, Value) -> rpc(name_server, {add, Key, Value}).
  find(Key)       -> rpc(name_server, {find, Key}).

  %% callback routines
  init() -> dict:new().
  handle({add, Key, Value}, Dict) -> {ok, dict:store(Key, Value, Dict)};
  handle({find, Key}, Dict)       -> {undefined:find(Key, Dict), Dict}.
#+END_SRC

测试下：

#+BEGIN_SRC sh 
  1> server2:start(name_server, name_server) .   
  true
  2>   
  2> name_server:find(abc) . 
  Server name_server request {find,abc} 
  caused exception undef
  ,** exception exit: rpc
       in function  server2:rpc/2 (server2.erl, line 18)
  3> 
  3> name_server:add(abc, 1) . 
#+END_SRC
