html/erlang/concurrency/otp.html
<div id="outline-container-org9d5c35c" class="outline-3">
<h3 id="org9d5c35c">实现事务</h3>
<div class="outline-text-3" id="text-org9d5c35c">
<p>
下面的代码在查询产生异常错误时会让客户端崩溃：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(server2).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start/2</span>, <span style="color: #98fb98;">rpc/2</span>]).

<span style="color: #87cefa;">start</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>) -&gt;
    <span style="color: #b0c4de;">register</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #b0c4de;">spawn</span>(<span style="color: #00ffff;">fun</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>,<span style="color: #eedd82;">Mod</span>,<span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">init</span>()) <span style="color: #00ffff;">end</span>)).

<span style="color: #87cefa;">rpc</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>) -&gt;
    <span style="color: #eedd82;">Name</span> ! {<span style="color: #b0c4de;">self</span>(), <span style="color: #eedd82;">Request</span>},
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">Name</span>, crash} -&gt;<span style="color: #87cefa;"> </span><span style="color: #b0c4de;">exit</span>(rpc);
        {<span style="color: #eedd82;">Name</span>, ok, <span style="color: #eedd82;">Response</span>} -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">Response</span>
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">OldState</span>) -&gt;
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">From</span>, <span style="color: #eedd82;">Request</span>} -&gt;
            <span style="color: #00ffff;">try</span> <span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">handle</span>(<span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">OldState</span>) <span style="color: #00ffff;">of</span>
                {<span style="color: #eedd82;">Response</span>, <span style="color: #eedd82;">NewState</span>} -&gt;
                    <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, ok, <span style="color: #eedd82;">Response</span>},
                    <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">NewState</span>)
            <span style="color: #00ffff;">catch</span>
                <span style="color: #eedd82;">_</span>:<span style="color: #eedd82;">Why</span> -&gt;
                    <span style="color: #98fb98;">log_the_error</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">Why</span>),
                    <span style="color: #ff4500;">%% </span><span style="color: #ff4500;">send a message to cause the client to crash</span>
                    <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, crash},
                    <span style="color: #ff4500;">%% </span><span style="color: #ff4500;">loop with the *original* state</span>
                    <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">OldState</span>)
            <span style="color: #00ffff;">end</span>
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">log_the_error</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">Why</span>) -&gt;
    <span style="color: #98fb98;">io</span>:<span style="color: #98fb98;">format</span>(<span style="color: #ffa07a;">"Server ~p request ~p ~n"</span>
              <span style="color: #ffa07a;">"caused exception ~p~n"</span>, 
              [<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">Why</span>]).
</pre>
</div>

<p>
这段代码在服务器里实现了 <span class="underline">事务语义</span> ：
</p>
<ul class="org-ul">
<li>在处理函数抛出异常错误时用 State (状态)的初始值继续循环
<ul class="org-ul">
<li>当处理函数失败时,服务器会给发送问题消息的客户端发送一个消息,让它崩溃
<ul class="org-ul">
<li>这个客户端不能继续工作,因为它发送给服务器的请求导致了处理函数的崩溃</li>
<li>其他想要使用服务器的客户端不会受到影响</li>
</ul></li>
</ul></li>
<li>如果处理函数成功了,它就会用处理函数提供的 NewState 值继续循环</li>
</ul>

<p>
请注意,这个服务器使用的回调模块和用于 server1 的回调模块一模一样。通过 <span class="underline">修改服务器</span> 并 <b>保持</b> <span class="underline">回调模块不变</span> ,就能 <b>修改回调模块的非业务行为</b> 
</p>

<pre class="example">
  从 server1 转到 server2 时,必须对回调模块做一点小小的改动

  也就是把 -import 声明里的 server1 改成 server2 。除此之外并无其他改动
</pre>


<p>
为了测试把name_server修改如下：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(name_server).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">init/0</span>, <span style="color: #98fb98;">add/2</span>, <span style="color: #98fb98;">find/1</span>, <span style="color: #98fb98;">handle/2</span>]).
<span style="color: #7fffd4;">-import</span>(server2, [<span style="color: #98fb98;">rpc/2</span>]).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">client routines</span>
<span style="color: #87cefa;">add</span>(<span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {add, <span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>}).
<span style="color: #87cefa;">find</span>(<span style="color: #eedd82;">Key</span>)       -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {find, <span style="color: #eedd82;">Key</span>}).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">callback routines</span>
<span style="color: #87cefa;">init</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">new</span>().
<span style="color: #87cefa;">handle</span>({add, <span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>}, <span style="color: #eedd82;">Dict</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">store</span>(<span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Value</span>, <span style="color: #eedd82;">Dict</span>)};
<span style="color: #87cefa;">handle</span>({find, <span style="color: #eedd82;">Key</span>}, <span style="color: #eedd82;">Dict</span>)       -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #98fb98;">undefined</span>:<span style="color: #98fb98;">find</span>(<span style="color: #eedd82;">Key</span>, <span style="color: #eedd82;">Dict</span>), <span style="color: #eedd82;">Dict</span>}.
</pre>
</div>

<p>
测试下：
</p>

<div class="org-src-container">
<pre class="src src-sh">1&gt; server2:start(name_server, name_server) <span style="color: #b0c4de;">.</span>   
true
2&gt;   
2&gt; name_server:find(abc) <span style="color: #b0c4de;">.</span> 
Server name_server request {find,abc} 
caused exception undef
** exception exit: rpc
     <span style="color: #00ffff;">in</span> <span style="color: #00ffff;">function</span>  <span style="color: #87cefa;">server2</span>:rpc/2 (server2.erl, line 18)
3&gt; 
3&gt; name_server:add(abc, 1) <span style="color: #b0c4de;">.</span> 
</pre>
</div>
</div>
</div>
