html/erlang/concurrency/otp.html
<div id="outline-container-org138ec7a" class="outline-3">
<h3 id="org138ec7a">热代码交换</h3>
<div class="outline-text-3" id="text-org138ec7a">
<pre class="example">
  现在将添加热代码交换(hot code swapping)功能

  大多数服务器都执行一个固定的程序,如果要修改服务器的行为,就必须先停止服务器,再用修改后的代码重启它
</pre>
<p>
而要修改这个服务器的行为,不用停止它,只需要发送一个包含新代码的消息,它就会提取新代码,然后用新代码和老的会话数据继续工作。这一过程被称为 <span class="underline">热代码交换</span> ：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(server3).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">start/2</span>, <span style="color: #98fb98;">rpc/2</span>, <span style="color: #98fb98;">swap_code/2</span>]).

<span style="color: #87cefa;">start</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>) -&gt;
    <span style="color: #b0c4de;">register</span>(<span style="color: #eedd82;">Name</span>, 
             <span style="color: #b0c4de;">spawn</span>(<span style="color: #00ffff;">fun</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>,<span style="color: #eedd82;">Mod</span>,<span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">init</span>()) <span style="color: #00ffff;">end</span>)).

<span style="color: #87cefa;">swap_code</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(<span style="color: #eedd82;">Name</span>, {swap_code, <span style="color: #eedd82;">Mod</span>}).

<span style="color: #87cefa;">rpc</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Request</span>) -&gt;
    <span style="color: #eedd82;">Name</span> ! {<span style="color: #b0c4de;">self</span>(), <span style="color: #eedd82;">Request</span>},
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Response</span>} -&gt;<span style="color: #87cefa;"> </span><span style="color: #eedd82;">Response</span>
    <span style="color: #00ffff;">end</span>.

<span style="color: #87cefa;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">OldState</span>) -&gt;
    <span style="color: #00ffff;">receive</span>
        {<span style="color: #eedd82;">From</span>, {swap_code, <span style="color: #eedd82;">NewCallBackMod</span>}} -&gt;
            <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, ack},
            <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">NewCallBackMod</span>, <span style="color: #eedd82;">OldState</span>);
        {<span style="color: #eedd82;">From</span>, <span style="color: #eedd82;">Request</span>} -&gt;
            {<span style="color: #eedd82;">Response</span>, <span style="color: #eedd82;">NewState</span>} = <span style="color: #eedd82;">Mod</span>:<span style="color: #98fb98;">handle</span>(<span style="color: #eedd82;">Request</span>, <span style="color: #eedd82;">OldState</span>),
            <span style="color: #eedd82;">From</span> ! {<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Response</span>},
            <span style="color: #98fb98;">loop</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Mod</span>, <span style="color: #eedd82;">NewState</span>)
    <span style="color: #00ffff;">end</span>.
</pre>
</div>

<p>
如果向服务器发送一个交换代码消息,它就会把 <span class="underline">回调模块</span> 改为 <span class="underline">消息里包含的新模块</span>  
</p>

<pre class="example">
  可以演示这一点,做法是用某个回调模块启动 server3 ,然后动态交换这个回调模块

  但不能用 name_server 作为回调模块,因为服务器名已经被硬编译进这个模块里了
</pre>

<p>
因此,将制作一个名为 <span class="underline">name_server1</span> 的副本,然后在里面修改服务器的名称：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(name_server1).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">init/0</span>, <span style="color: #98fb98;">add/2</span>, <span style="color: #98fb98;">find/1</span>, <span style="color: #98fb98;">handle/2</span>]).
<span style="color: #7fffd4;">-import</span>(server3, [<span style="color: #98fb98;">rpc/2</span>]).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">client routines</span>
<span style="color: #87cefa;">add</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {add, <span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>}).
<span style="color: #87cefa;">find</span>(<span style="color: #eedd82;">Name</span>)       -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {find, <span style="color: #eedd82;">Name</span>}).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">callback routines</span>
<span style="color: #87cefa;">init</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">new</span>().

<span style="color: #87cefa;">handle</span>({add, <span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>}, <span style="color: #eedd82;">Dict</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">store</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>, <span style="color: #eedd82;">Dict</span>)};
<span style="color: #87cefa;">handle</span>({find, <span style="color: #eedd82;">Name</span>}, <span style="color: #eedd82;">Dict</span>)       -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">find</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Dict</span>), <span style="color: #eedd82;">Dict</span>}.
</pre>
</div>

<pre class="example">
现在假设想要找出这个名称服务器能提供的所有名称

API里没有函数能做到这一点,因为 name_server_1 模块只包含访问函数 add 和 find 
</pre>
<p>
于是我们以闪电般的速度打开文本编辑器并编写一个新的回调模块：
</p>

<div class="org-src-container">
<pre class="src src-erlang"><span style="color: #7fffd4;">-module</span>(new_name_server).
<span style="color: #7fffd4;">-export</span>([<span style="color: #98fb98;">init/0</span>, <span style="color: #98fb98;">add/2</span>, <span style="color: #98fb98;">all_names/0</span>, <span style="color: #98fb98;">delete/1</span>, <span style="color: #98fb98;">find/1</span>, <span style="color: #98fb98;">handle/2</span>]).
<span style="color: #7fffd4;">-import</span>(server3, [<span style="color: #98fb98;">rpc/2</span>]).

<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">interface</span>
<span style="color: #87cefa;">all_names</span>()      -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, allNames).
<span style="color: #87cefa;">add</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>) -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {add, <span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>}).
<span style="color: #87cefa;">delete</span>(<span style="color: #eedd82;">Name</span>)     -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {delete, <span style="color: #eedd82;">Name</span>}).
<span style="color: #87cefa;">find</span>(<span style="color: #eedd82;">Name</span>)       -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">rpc</span>(name_server, {find, <span style="color: #eedd82;">Name</span>}).
<span style="color: #ff4500;">%% </span><span style="color: #ff4500;">callback routines</span>
<span style="color: #87cefa;">init</span>() -&gt;<span style="color: #87cefa;"> </span><span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">new</span>().

<span style="color: #87cefa;">handle</span>({add, <span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>}, <span style="color: #eedd82;">Dict</span>) -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">store</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Place</span>, <span style="color: #eedd82;">Dict</span>)};
<span style="color: #87cefa;">handle</span>(allNames, <span style="color: #eedd82;">Dict</span>)           -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">fetch_keys</span>(<span style="color: #eedd82;">Dict</span>), <span style="color: #eedd82;">Dict</span>};
<span style="color: #87cefa;">handle</span>({delete, <span style="color: #eedd82;">Name</span>}, <span style="color: #eedd82;">Dict</span>)     -&gt;<span style="color: #87cefa;"> </span>{ok, <span style="color: #98fb98;">dict</span>:<span style="color: #b0c4de;">erase</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Dict</span>)};
<span style="color: #87cefa;">handle</span>({find, <span style="color: #eedd82;">Name</span>}, <span style="color: #eedd82;">Dict</span>)       -&gt;<span style="color: #87cefa;"> </span>{<span style="color: #98fb98;">dict</span>:<span style="color: #98fb98;">find</span>(<span style="color: #eedd82;">Name</span>, <span style="color: #eedd82;">Dict</span>), <span style="color: #eedd82;">Dict</span>}.
</pre>
</div>

<p>
编译这个模块并告知服务器交换它的回调模块：
</p>

<div class="org-src-container">
<pre class="src src-sh">4&gt; c (new_name_server) <span style="color: #b0c4de;">.</span> 
{ok,new_name_server}
5&gt; 
5&gt; server3:swap_code(name_server, new_name_server) <span style="color: #b0c4de;">.</span>  
ack
</pre>
</div>

<p>
现在就可以运行服务器里的新函数了：
</p>

<div class="org-src-container">
<pre class="src src-sh">6&gt; new_name_server:all_names() <span style="color: #b0c4de;">.</span> 
[joe,helen]
</pre>
</div>

<p>
在这里实时更换了 <span class="underline">回调模块</span> ,这就是 <b>动态代码升级</b> ,就发生在你的眼前,没有什么黑魔法
</p>

<pre class="example">
  现在再停下来想一想。之前完成的两个任务通常都被认为很有难度,事实的确如此

  编写能实现“事务语义”的服务器很困难,编写能实现动态代码升级的服务器也很困难,但这个方法让它们变得简单了
</pre>

<p>
这个方法极其强大。传统上我们认为服务器是有状态的程序,当我们向它发送消息时会改变它的状态。服务器里的代码在首次调用时就固定了,如果想要修改服务器里的代码,就必须停止服务器并修改代码,然后重启服务器
</p>

<pre class="example">
  在前面的例子中,修改服务器的代码就像修改服务器的状态那样简单

  我们用这个方法编写了许多产品,它们从来不会因为软件维护升级而停止服务
</pre>
</div>
</div>
